InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаОтКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МелкийОпт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрупныйОпт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаНакладных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьДублиСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязыватьИнвойсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/StockAPI/Ext/Module.bsl
Функция ШаблонURL1Остатки(Запрос)
	
	Пагинация = ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Возврат ОтветJSON(400, Новый Структура("error", Пагинация.Ошибка));
	КонецЕсли;
	
	ФильтрСклада = СкладОстатковИзЗапроса(Запрос);
	Если ФильтрСклада.Ошибка <> "" Тогда
		Возврат ОтветJSON(400, Новый Структура("error", ФильтрСклада.Ошибка));
	КонецЕсли;
	
	ДатаОстатков = КонецДня(ТекущаяДатаСеанса());
	
	СтрокаДаты = Запрос.ПараметрыЗапроса.Получить("date");
	Если СтрокаДаты <> Неопределено И СтрокаДаты <> "" Тогда
		ДатаОстатков = КонецДня(Дата(СтрокаДаты));
	КонецЕсли;
	
	ВидЦены = ВидЦеныИзПараметра(Запрос.ПараметрыЗапроса.Получить("priceType"));
	ИмяВидаЦены = Строка(ВидЦены);
	
	ВсегоНоменклатуры = КоличествоНоменклатурыНаОстатках(ДатаОстатков, ФильтрСклада.Склад);
	ВсегоСтраниц = ВсегоСтраницПагинации(ВсегоНоменклатуры, Пагинация.pageSize);
	Пропустить = (Пагинация.page - 1) * Пагинация.pageSize;
	НоменклатураСтраницы = НоменклатураНаОстаткахСтраница(ДатаОстатков, Пагинация.pageSize, Пропустить, ФильтрСклада.Склад);
	
	Таблица = ТаблицаОстатковПоНоменклатуре(ДатаОстатков, НоменклатураСтраницы, ФильтрСклада.Склад);
	
	ЦеныПоНоменклатуре = ЗагрузитьЦеныПродажи(ДатаОстатков, УникальнаяНоменклатураИзТаблицы(Таблица), ВидЦены);
	
	СерииПоПартиям = СерииИзСтрокПриходных(Таблица);
	СерииПоГруппе = СерииИзСтрокПриходныхПоГруппе(ДатаОстатков, НоменклатураСтраницы, ФильтрСклада.Склад);
	
	Группы = Новый Соответствие;
	
	Для Каждого Стр Из Таблица Цикл
		
		Ключ = КлючГруппыОстатков(Стр.warehouse, Стр.itemCode, Стр.batch);
		Элемент = Группы.Получить(Ключ);
		
		Если Элемент = Неопределено Тогда
			Элемент = Новый Структура;
			Элемент.Вставить("warehouse", Строка(Стр.warehouse));
			Элемент.Вставить("item", Строка(Стр.item));
			Элемент.Вставить("itemCode", Строка(Стр.itemCode));
			Элемент.Вставить("sku", Строка(Стр.sku));
			Элемент.Вставить("itemType", Строка(Стр.itemType));
			Элемент.Вставить("manufacturer", Строка(Стр.manufacturer));
			Элемент.Вставить("batch", Строка(Стр.batch));
			Элемент.Вставить("qty", 0);
			Элемент.Вставить("reserve", 0);
			Элемент.Вставить("serials", Новый Массив);
			Элемент.Вставить("units", Новый Массив);
			Элемент.Вставить("Номенклатура", Стр.Номенклатура);
			Группы.Вставить(Ключ, Элемент);
		КонецЕсли;
		
		Элемент.qty = Элемент.qty + Стр.qty;
		Элемент.reserve = Элемент.reserve + Стр.reserve;
		
		Серия = СокрЛП(Стр.serialParty);
		Если Серия = "" Тогда
			МассивСерийПартии = СерииПоПартиям.Получить(Стр.Партия);
			Если МассивСерийПартии <> Неопределено И МассивСерийПартии.Количество() > 0 Тогда
				Серия = МассивСерийПартии[0];
			КонецЕсли;
		КонецЕсли;
		
		Единица = Новый Структура;
		Единица.Вставить("batchCode", Строка(Стр.batchCode));
		Единица.Вставить("sku", Строка(Стр.sku));
		Единица.Вставить("itemType", Строка(Стр.itemType));
		Единица.Вставить("manufacturer", Строка(Стр.manufacturer));
		Единица.Вставить("serial", Серия);
		Единица.Вставить("qty", Стр.qty);
		Элемент.units.Добавить(Единица);
		
		ДобавитьСерийникВМассив(Элемент.serials, Серия);
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Группы Цикл
		Элемент = КлючИЗначение.Значение;
		МассивДоп = СерииПоГруппе.Получить(КлючИЗначение.Ключ);
		Если МассивДоп <> Неопределено Тогда
			Для Каждого Серия Из МассивДоп Цикл
				ДобавитьСерийникВМассив(Элемент.serials, Серия);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Группы Цикл
		Элемент = КлючИЗначение.Значение;
		ДанныеЦены = ЦеныПоНоменклатуре.Получить(Элемент.Номенклатура);
		ДобавитьЦенуВСтруктуру(Элемент, ДанныеЦены, Элемент.qty, ИмяВидаЦены);
		Для Каждого Единица Из Элемент.units Цикл
			ДобавитьЦенуВСтруктуру(Единица, ДанныеЦены, Единица.qty, ИмяВидаЦены);
		КонецЦикла;
		Элемент.Удалить("Номенклатура");
	КонецЦикла;
	
	МассивСтрок = Новый Массив;
	Для Каждого КлючИЗначение Из Группы Цикл
		МассивСтрок.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", Пагинация.page);
	ТелоОтвета.Вставить("pageSize", Пагинация.pageSize);
	ТелоОтвета.Вставить("totalItems", ВсегоНоменклатуры);
	ТелоОтвета.Вставить("totalPages", ВсегоСтраниц);
	ТелоОтвета.Вставить("items", МассивСтрок);
	Если ЗначениеЗаполнено(ФильтрСклада.Склад) Тогда
		ТелоОтвета.Вставить("warehouse", Строка(ФильтрСклада.Склад));
		ТелоОтвета.Вставить("warehouseCode", ФильтрСклада.warehouseCode);
	КонецЕсли;
	
	Возврат ОтветJSON(200, ТелоОтвета);
	
КонецФункции

// Создание заказа покупателя = расходная накладная без флага «Окончательно» (резерв на складе).
Функция ordersPOST(Запрос)
	
	Попытка
		ДанныеЗапроса = ПрочитатьТелоJSON(Запрос);
		РезультатСоздания = СоздатьЗаказПокупателя(ДанныеЗапроса);
		Возврат ОтветJSON(?(РезультатСоздания.success, 200, 400), РезультатСоздания);
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

// Список покупателей (элементы справочника Контрагенты в группе «КонтрагентыПокупатели»).
Функция customersGET(Запрос)
	
	Попытка
		МассивПокупателей = ПолучитьСписокПокупателей(Запрос);
		Возврат ОтветJSON(200, МассивПокупателей);
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

// Создание контрагента в справочнике Контрагенты (по умолчанию — группа покупателей).
Функция customersPOST(Запрос)
	
	Попытка
		ДанныеЗапроса = ПрочитатьТелоJSON(Запрос);
		РезультатСоздания = СоздатьКонтрагента(ДанныеЗапроса);
		Возврат ОтветJSON(?(РезультатСоздания.success, 200, 400), РезультатСоздания);
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

// Группы контрагентов (папки справочника Контрагенты) и привязка к настройкам пользователя.
Функция customerGroupsGET(Запрос)
	
	Попытка
		Возврат ОтветJSON(200, ПолучитьСведенияОГруппахКонтрагентов(Запрос));
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

Функция customerGroupsPOST(Запрос)
	
	Попытка
		ДанныеЗапроса = ПрочитатьТелоJSON(Запрос);
		РезультатСоздания = СоздатьГруппуКонтрагентовAPI(ДанныеЗапроса);
		Возврат ОтветJSON(?(РезультатСоздания.success, 200, 400), РезультатСоздания);
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

// Список складов (наименование — поле warehouse в заказе).
Функция warehousesGET(Запрос)
	
	Попытка
		Возврат ОтветJSON(200, ПолучитьСписокСкладов(Запрос));
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

// Список валют (наименование — поле currency в заказе).
Функция currenciesGET(Запрос)
	
	Попытка
		Возврат ОтветJSON(200, ПолучитьСписокВалют(Запрос));
	Исключение
		Возврат ОтветJSON(500, Новый Структура("success, error", Ложь, ОписаниеОшибки()));
	КонецПопытки;
	
КонецФункции

Функция ПрочитатьТелоJSON(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	Если СокрЛП(Тело) = "" Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Функция ОтветJSON(КодСостояния, Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Возврат Ответ;
	
КонецФункции

Функция СоздатьЗаказПокупателя(ДанныеЗапроса)
	
	Результат = Новый Структура("success, error, orderNumber, orderDate, reserved", Ложь, "", "", "", Ложь);
	
	Контрагент = НайтиКонтрагента(ДанныеЗапроса);
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Результат.error = "Не найден покупатель. Укажите customer (наименование) или customerCode (код).";
		Возврат Результат;
	КонецЕсли;
	
	Фирма = НайтиФирму(ДанныеЗапроса);
	Склад = НайтиСклад(ДанныеЗапроса, Фирма);
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Результат.error = "Не найден склад. Укажите warehouse (наименование склада).";
		Возврат Результат;
	КонецЕсли;
	
	СтрокиЗаказа = СтрокиЗаказаИзЗапроса(ДанныеЗапроса, Фирма, Склад);
	Если СтрокиЗаказа.Ошибки.Количество() > 0 Тогда
		Результат.error = ТекстОшибокСписка(СтрокиЗаказа.Ошибки);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрокиЗаказа.Строки.Количество() = 0 Тогда
		Результат.error = "Список items пуст или все позиции отклонены.";
		Возврат Результат;
	КонецЕсли;
	
	ВидЦены = ВидЦеныИзПараметра(?(ДанныеЗапроса.Свойство("priceType"), ДанныеЗапроса.priceType, ""));
	ИмяВидаЦены = Строка(ВидЦены);
	ЦеныПродажи = ЗагрузитьЦеныПродажи(КонецДня(ТекущаяДатаСеанса()), НоменклатураИзСтрокЗаказа(СтрокиЗаказа.Строки), ВидЦены);
	
	ОшибкиЦен = ПроверитьЦеныСтрокЗаказа(СтрокиЗаказа.Строки, ЦеныПродажи, ИмяВидаЦены);
	Если ОшибкиЦен.Количество() > 0 Тогда
		Результат.error = ТекстОшибокСписка(ОшибкиЦен);
		Возврат Результат;
	КонецЕсли;
	
	Валюта = ?(ДанныеЗапроса.Свойство("currency") И ЗначениеЗаполнено(ДанныеЗапроса.currency),
		Справочники.Валюты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.currency), Истина),
		Фирма.Валюта);
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Фирма.Валюта;
	КонецЕсли;
	
	Док = Документы.РасходнаяНакладная.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.Фирма = Фирма;
	Док.Склад = Склад;
	Док.Контрагент = Контрагент;
	Док.Валюта = Валюта;
	Док.Окончательно = Ложь;
	
	Для Каждого СтрЗаказа Из СтрокиЗаказа.Строки Цикл
		
		НовСтр = Док.Товары.Добавить();
		НовСтр.Номенклатура = СтрЗаказа.Номенклатура;
		НовСтр.Партия = СтрЗаказа.Партия;
		НовСтр.Серия = СтрЗаказа.Серия;
		НовСтр.Количество = СтрЗаказа.Количество;
		
		НовСтр.ЦенаПродажи = СтрЗаказа.Цена;
		НовСтр.СуммаПродажи = СтрЗаказа.Цена * НовСтр.Количество;
		
	КонецЦикла;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Результат.error = "Не удалось провести заказ: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Результат.success = Истина;
	Результат.orderNumber = Док.Номер;
	Результат.orderDate = Формат(Док.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss");
	Результат.reserved = Истина;
	Возврат Результат;
	
КонецФункции

Функция ГруппаПокупателей()
	
	Возврат ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("КонтрагентыПокупатели");
	
КонецФункции

Функция ГруппаПоставщиков()
	
	Возврат ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("КонтрагентыПоставщики");
	
КонецФункции

Функция ТипКонтрагентаИзПараметра(ЗначениеТипа)
	
	ТипКонтрагента = НРег(СокрЛП(Строка(ЗначениеТипа)));
	
	Если ТипКонтрагента = "supplier"
		Или ТипКонтрагента = "поставщик"
		Или ТипКонтрагента = "suppliers" Тогда
		Возврат "supplier";
	КонецЕсли;
	
	Возврат "customer";
	
КонецФункции

Функция ТипКонтрагентаИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат "customer";
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("type") Тогда
		Возврат ТипКонтрагентаИзПараметра(ДанныеЗапроса.type);
	КонецЕсли;
	
	Возврат "customer";
	
КонецФункции

Функция ИмяНастройкиГруппыКонтрагентов(ТипКонтрагента)
	
	Если ТипКонтрагента = "supplier" Тогда
		Возврат "КонтрагентыПоставщики";
	КонецЕсли;
	
	Возврат "КонтрагентыПокупатели";
	
КонецФункции

Функция ГруппаКонтрагентовИзНастройки(ТипКонтрагента)
	
	Если ТипКонтрагента = "supplier" Тогда
		Возврат ГруппаПоставщиков();
	КонецЕсли;
	
	Возврат ГруппаПокупателей();
	
КонецФункции

Функция ИмяГруппыПоУмолчанию(ТипКонтрагента)
	
	Если ТипКонтрагента = "supplier" Тогда
		Возврат "Поставщики API";
	КонецЕсли;
	
	Возврат "Покупатели API";
	
КонецФункции

Функция ИменаГруппДляПоиска(ТипКонтрагента)
	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить(ИмяГруппыПоУмолчанию(ТипКонтрагента));
	
	Если ТипКонтрагента = "supplier" Тогда
		МассивИмен.Добавить("Поставщики");
		МассивИмен.Добавить("Контрагенты поставщики");
	Иначе
		МассивИмен.Добавить("Покупатели");
		МассивИмен.Добавить("Контрагенты покупатели");
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

Функция НайтиГруппуКонтрагентовПоИмени(ИмяГруппы)
	
	Имя = СокрЛП(ИмяГруппы);
	Если Имя = "" Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Конт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Конт
	|ГДЕ
	|	Конт.ЭтоГруппа
	|	И НЕ Конт.ПометкаУдаления
	|	И Конт.Наименование = &Наименование";
	Зап.УстановитьПараметр("Наименование", Имя);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция НайтиГруппуКонтрагентовПоКоду(КодГруппы)
	
	КодСтрока = СокрЛП(Строка(КодГруппы));
	Если КодСтрока = "" Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Группа = Справочники.Контрагенты.НайтиПоКоду(Число(КодСтрока));
	Если ЗначениеЗаполнено(Группа) И Группа.ЭтоГруппа Тогда
		Возврат Группа;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ИмяГруппыИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("group") И СокрЛП(ДанныеЗапроса.group) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.group);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("parent") И СокрЛП(ДанныеЗапроса.parent) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.parent);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("groupName") И СокрЛП(ДанныеЗапроса.groupName) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.groupName);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("name") И СокрЛП(ДанныеЗапроса.name) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.name);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция АвтоСозданиеГруппыРазрешено(ДанныеЗапроса)
	
	Если ДанныеЗапроса = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("autoCreateGroup") Тогда
		Возврат ДанныеЗапроса.autoCreateGroup = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура УстановитьГруппуВНастройках(ТипКонтрагента, Группа)
	
	РегистрыСведений.НастройкиПользователей.Установить(Группа, ИмяНастройкиГруппыКонтрагентов(ТипКонтрагента));
	
КонецПроцедуры

Функция СоздатьГруппуКонтрагентовВСправочнике(ИмяГруппы)
	
	Объект = Справочники.Контрагенты.СоздатьГруппу();
	Объект.Наименование = СокрЛП(ИмяГруппы);
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

Функция СтруктураГруппыКонтрагентов(Группа, ТипКонтрагента, ЭтоГруппаПоУмолчанию = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("group", "");
	Результат.Вставить("groupCode", "");
	Результат.Вставить("type", ТипКонтрагента);
	Результат.Вставить("isDefault", ЭтоГруппаПоУмолчанию);
	Результат.Вставить("configured", Ложь);
	
	Если ЗначениеЗаполнено(Группа) Тогда
		Результат.group = Строка(Группа);
		Результат.groupCode = КодКонтрагентаВСтроку(Группа.Код);
		Результат.configured = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазрешитьГруппуКонтрагентов(ДанныеЗапроса, АвтоСоздать = Ложь)
	
	ТипКонтрагента = ТипКонтрагентаИзЗапроса(ДанныеЗапроса);
	
	Если ДанныеЗапроса <> Неопределено И ДанныеЗапроса.Свойство("groupCode") Тогда
		Группа = НайтиГруппуКонтрагентовПоКоду(ДанныеЗапроса.groupCode);
		Если ЗначениеЗаполнено(Группа) Тогда
			Возврат Группа;
		КонецЕсли;
	КонецЕсли;
	
	ИмяГруппы = ИмяГруппыИзЗапроса(ДанныеЗапроса);
	Если ИмяГруппы <> "" Тогда
		Группа = НайтиГруппуКонтрагентовПоИмени(ИмяГруппы);
		Если ЗначениеЗаполнено(Группа) Тогда
			Возврат Группа;
		КонецЕсли;
	КонецЕсли;
	
	Группа = ГруппаКонтрагентовИзНастройки(ТипКонтрагента);
	Если ЗначениеЗаполнено(Группа) Тогда
		Возврат Группа;
	КонецЕсли;
	
	Для Каждого ИмяПоиска Из ИменаГруппДляПоиска(ТипКонтрагента) Цикл
		Группа = НайтиГруппуКонтрагентовПоИмени(ИмяПоиска);
		Если ЗначениеЗаполнено(Группа) Тогда
			УстановитьГруппуВНастройках(ТипКонтрагента, Группа);
			Возврат Группа;
		КонецЕсли;
	КонецЦикла;
	
	Если АвтоСоздать Тогда
		Группа = СоздатьГруппуКонтрагентовВСправочнике(ИмяГруппыПоУмолчанию(ТипКонтрагента));
		УстановитьГруппуВНастройках(ТипКонтрагента, Группа);
		Возврат Группа;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ГруппаКонтрагентовПоТипу(ДанныеЗапроса)
	
	Возврат РазрешитьГруппуКонтрагентов(ДанныеЗапроса, АвтоСозданиеГруппыРазрешено(ДанныеЗапроса));
	
КонецФункции

Функция ПолучитьСписокГруппКонтрагентов()
	
	Массив = Новый Массив;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Конт.Наименование КАК group,
	|	Конт.Код КАК Код
	|ИЗ
	|	Справочник.Контрагенты КАК Конт
	|ГДЕ
	|	Конт.ЭтоГруппа
	|	И НЕ Конт.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Конт.Наименование";
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("group", Строка(Выборка.group));
		Элемент.Вставить("groupCode", КодКонтрагентаВСтроку(Выборка.Код));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСведенияОГруппахКонтрагентов(Запрос)
	
	ТипКонтрагента = "customer";
	ПараметрТипа = Запрос.ПараметрыЗапроса.Получить("type");
	Если ПараметрТипа <> Неопределено Тогда
		ТипКонтрагента = ТипКонтрагентаИзПараметра(ПараметрТипа);
	КонецЕсли;
	
	ГруппаПоУмолчанию = ГруппаКонтрагентовИзНастройки(ТипКонтрагента);
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("type", ТипКонтрагента);
	ТелоОтвета.Вставить("settingName", ИмяНастройкиГруппыКонтрагентов(ТипКонтрагента));
	ТелоОтвета.Вставить("defaultGroup", СтруктураГруппыКонтрагентов(ГруппаПоУмолчанию, ТипКонтрагента, Истина));
	ТелоОтвета.Вставить("suggestedNames", ИменаГруппДляПоиска(ТипКонтрагента));
	
	Элементы = Новый Массив;
	Для Каждого СтрГруппы Из ПолучитьСписокГруппКонтрагентов() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("group", СтрГруппы.group);
		Элемент.Вставить("groupCode", СтрГруппы.groupCode);
		Элемент.Вставить("type", ТипКонтрагента);
		Элемент.Вставить("isDefault", ЗначениеЗаполнено(ГруппаПоУмолчанию)
			И СтрГруппы.group = Строка(ГруппаПоУмолчанию));
		Элементы.Добавить(Элемент);
	КонецЦикла;
	ТелоОтвета.Вставить("items", Элементы);
	
	Возврат ТелоОтвета;
	
КонецФункции

Функция СоздатьГруппуКонтрагентовAPI(ДанныеЗапроса)
	
	Результат = Новый Структура("success, error, group, groupCode, type, settingName, configured",
		Ложь, "", "", "", "", "", Ложь);
	
	ИмяГруппы = ИмяГруппыИзЗапроса(ДанныеЗапроса);
	Если ИмяГруппы = "" Тогда
		Результат.error = "Укажите name или group (наименование группы).";
		Возврат Результат;
	КонецЕсли;
	
	ТипКонтрагента = ТипКонтрагентаИзЗапроса(ДанныеЗапроса);
	Существующая = НайтиГруппуКонтрагентовПоИмени(ИмяГруппы);
	Если ЗначениеЗаполнено(Существующая) Тогда
		Группа = Существующая;
	Иначе
		Попытка
			Группа = СоздатьГруппуКонтрагентовВСправочнике(ИмяГруппы);
		Исключение
			Результат.error = "Не удалось создать группу: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПоУмолчанию = Истина;
	Если ДанныеЗапроса.Свойство("setAsDefault") Тогда
		УстановитьПоУмолчанию = ДанныеЗапроса.setAsDefault = Истина;
	ИначеЕсли ДанныеЗапроса.Свойство("configure") Тогда
		УстановитьПоУмолчанию = ДанныеЗапроса.configure = Истина;
	КонецЕсли;
	
	Если УстановитьПоУмолчанию Тогда
		УстановитьГруппуВНастройках(ТипКонтрагента, Группа);
	КонецЕсли;
	
	Результат.success = Истина;
	Результат.group = Строка(Группа);
	Результат.groupCode = КодКонтрагентаВСтроку(Группа.Код);
	Результат.type = ТипКонтрагента;
	Результат.settingName = ИмяНастройкиГруппыКонтрагентов(ТипКонтрагента);
	Результат.configured = УстановитьПоУмолчанию;
	Возврат Результат;
	
КонецФункции

Функция НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("customer") И СокрЛП(ДанныеЗапроса.customer) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.customer);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("counterparty") И СокрЛП(ДанныеЗапроса.counterparty) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.counterparty);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("name") И СокрЛП(ДанныеЗапроса.name) <> "" Тогда
		Возврат СокрЛП(ДанныеЗапроса.name);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ТипКонтрагентаДляОтвета(Группа, ТипКонтрагента = "customer")
	
	Если ТипКонтрагента = "supplier" Тогда
		Возврат "supplier";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Группа) И ЗначениеЗаполнено(ГруппаПоставщиков()) И Группа = ГруппаПоставщиков() Тогда
		Возврат "supplier";
	КонецЕсли;
	
	Возврат "customer";
	
КонецФункции

Функция ПолучитьСписокПокупателей(Запрос)
	
	ГруппаПокупателей = РазрешитьГруппуКонтрагентов(Новый Структура("type", "customer"), Ложь);
	БезГруппы = НЕ ЗначениеЗаполнено(ГруппаПокупателей);
	
	СтрокаПоиска = "";
	ПараметрПоиска = Запрос.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	БезПоиска = СтрокаПоиска = "";
	ШаблонПоиска = "%" + СтрокаПоиска + "%";
	
	СтрокаКода = "";
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("customerCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли;
	БезКода = СтрокаКода = "";
	КодЧисло = 0;
	Если НЕ БезКода Тогда
		КодЧисло = Число(СтрокаКода);
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Конт.Код КАК Код,
	|	Конт.Наименование КАК customer,
	|	Конт.Псевдоним КАК alias,
	|	Конт.Email КАК email,
	|	Конт.Телефоны КАК phone,
	|	Конт.Город КАК city,
	|	Конт.Адрес КАК address
	|ИЗ
	|	Справочник.Контрагенты КАК Конт
	|ГДЕ
	|	НЕ Конт.ЭтоГруппа
	|	И НЕ Конт.ПометкаУдаления
	|	И (&БезГруппы
	|		ИЛИ Конт.Ссылка В ИЕРАРХИИ (&ГруппаПокупателей))
	|	И (&БезПоиска
	|		ИЛИ Конт.Наименование ПОДОБНО &ШаблонПоиска
	|		ИЛИ Конт.Псевдоним ПОДОБНО &ШаблонПоиска)
	|	И (&БезКода
	|		ИЛИ Конт.Код = &Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Конт.Наименование";
	Зап.УстановитьПараметр("БезГруппы", БезГруппы);
	Зап.УстановитьПараметр("ГруппаПокупателей", ГруппаПокупателей);
	Зап.УстановитьПараметр("БезПоиска", БезПоиска);
	Зап.УстановитьПараметр("ШаблонПоиска", ШаблонПоиска);
	Зап.УстановитьПараметр("БезКода", БезКода);
	Зап.УстановитьПараметр("Код", КодЧисло);
	
	Таблица = Зап.Выполнить().Выгрузить();
	Массив = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("customer", Строка(Стр.customer));
		Элемент.Вставить("customerCode", КодКонтрагентаВСтроку(Стр.Код));
		Элемент.Вставить("alias", Строка(Стр.alias));
		Элемент.Вставить("email", Строка(Стр.email));
		Элемент.Вставить("phone", Строка(Стр.phone));
		Элемент.Вставить("city", Строка(Стр.city));
		Элемент.Вставить("address", Строка(Стр.address));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокСкладов(Запрос)
	
	МассивДоступных = омСервер.МассивСкладов();
	ОграничитьПоДоступу = МассивДоступных.Количество() > 0;
	
	СтрокаПоиска = "";
	ПараметрПоиска = Запрос.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	БезПоиска = СтрокаПоиска = "";
	ШаблонПоиска = "%" + СтрокаПоиска + "%";
	
	СтрокаКода = "";
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли;
	БезКода = СтрокаКода = "";
	КодЧисло = 0;
	Если НЕ БезКода Тогда
		КодЧисло = Число(СтрокаКода);
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Скл.Код КАК Код,
	|	Скл.Наименование КАК warehouse
	|ИЗ
	|	Справочник.Склады КАК Скл
	|ГДЕ
	|	НЕ Скл.ПометкаУдаления
	|	И (&ОграничитьПоДоступу = ЛОЖЬ
	|		ИЛИ Скл.Ссылка В (&МассивДоступных))
	|	И (&БезПоиска
	|		ИЛИ Скл.Наименование ПОДОБНО &ШаблонПоиска)
	|	И (&БезКода
	|		ИЛИ Скл.Код = &Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Скл.Наименование";
	Зап.УстановитьПараметр("ОграничитьПоДоступу", ОграничитьПоДоступу);
	Зап.УстановитьПараметр("МассивДоступных", МассивДоступных);
	Зап.УстановитьПараметр("БезПоиска", БезПоиска);
	Зап.УстановитьПараметр("ШаблонПоиска", ШаблонПоиска);
	Зап.УстановитьПараметр("БезКода", БезКода);
	Зап.УстановитьПараметр("Код", КодЧисло);
	
	Таблица = Зап.Выполнить().Выгрузить();
	Массив = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("warehouse", Строка(Стр.warehouse));
		Элемент.Вставить("warehouseCode", КодСкладаВСтроку(Стр.Код));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокВалют(Запрос)
	
	СтрокаПоиска = "";
	ПараметрПоиска = Запрос.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	БезПоиска = СтрокаПоиска = "";
	ШаблонПоиска = "%" + СтрокаПоиска + "%";
	
	СтрокаКода = "";
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("currencyCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли;
	БезКода = СтрокаКода = "";
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Вал.Код КАК Код,
	|	Вал.Наименование КАК currency,
	|	Вал.Обозначение КАК symbol,
	|	Вал.Символ КАК sign
	|ИЗ
	|	Справочник.Валюты КАК Вал
	|ГДЕ
	|	НЕ Вал.ПометкаУдаления
	|	И (&БезПоиска
	|		ИЛИ Вал.Наименование ПОДОБНО &ШаблонПоиска
	|		ИЛИ Вал.Код ПОДОБНО &ШаблонПоиска
	|		ИЛИ Вал.Обозначение ПОДОБНО &ШаблонПоиска)
	|	И (&БезКода
	|		ИЛИ Вал.Код = &Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вал.Наименование";
	Зап.УстановитьПараметр("БезПоиска", БезПоиска);
	Зап.УстановитьПараметр("ШаблонПоиска", ШаблонПоиска);
	Зап.УстановитьПараметр("БезКода", БезКода);
	Зап.УстановитьПараметр("Код", СтрокаКода);
	
	Таблица = Зап.Выполнить().Выгрузить();
	Массив = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("currency", Строка(Стр.currency));
		Элемент.Вставить("currencyCode", СокрЛП(Строка(Стр.Код)));
		Элемент.Вставить("symbol", Строка(Стр.symbol));
		Элемент.Вставить("sign", Строка(Стр.sign));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция КодСкладаВСтроку(Код)
	
	Если Код = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Формат(Код, "ЧГ=0");
	
КонецФункции

Функция СоздатьКонтрагента(ДанныеЗапроса)
	
	Результат = Новый Структура("success, error, customer, customerCode, counterparty, counterpartyCode, type, group, groupCode",
		Ложь, "", "", "", "", "", "", "", "");
	
	Наименование = НаименованиеКонтрагентаИзЗапроса(ДанныеЗапроса);
	Если Наименование = "" Тогда
		Результат.error = "Укажите customer, counterparty или name (наименование контрагента).";
		Возврат Результат;
	КонецЕсли;
	
	Существующий = Справочники.Контрагенты.НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Существующий) Тогда
		Результат.error = СтрШаблон("Контрагент ""%1"" уже существует (код %2).",
			Наименование,
			КодКонтрагентаВСтроку(Существующий.Код));
		Возврат Результат;
	КонецЕсли;
	
	Группа = ГруппаКонтрагентовПоТипу(ДанныеЗапроса);
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
		ТипЗапроса = ТипКонтрагентаИзЗапроса(ДанныеЗапроса);
		ИмяНастройки = ИмяНастройкиГруппыКонтрагентов(ТипЗапроса);
		Результат.error = СтрШаблон(
			"Не найдена группа контрагентов (настройка %1). Укажите group, POST /customer-groups или autoCreateGroup: true.",
			ИмяНастройки);
		Возврат Результат;
	КонецЕсли;
	
	Объект = Справочники.Контрагенты.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Родитель = Группа;
	
	Если ДанныеЗапроса.Свойство("alias") Тогда
		Объект.Псевдоним = СокрЛП(ДанныеЗапроса.alias);
	ИначеЕсли ДанныеЗапроса.Свойство("pseudonym") Тогда
		Объект.Псевдоним = СокрЛП(ДанныеЗапроса.pseudonym);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("email") Тогда
		Объект.Email = СокрЛП(ДанныеЗапроса.email);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("phone") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phone);
	ИначеЕсли ДанныеЗапроса.Свойство("phones") Тогда
		Объект.Телефоны = СокрЛП(ДанныеЗапроса.phones);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("city") Тогда
		Объект.Город = СокрЛП(ДанныеЗапроса.city);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("address") Тогда
		Объект.Адрес = СокрЛП(ДанныеЗапроса.address);
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("note") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.note);
	ИначеЕсли ДанныеЗапроса.Свойство("comment") Тогда
		Объект.Примечание = СокрЛП(ДанныеЗапроса.comment);
	КонецЕсли;
	
	Попытка
		Объект.Записать();
	Исключение
		Результат.error = "Не удалось создать контрагента: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	КодСтрокой = КодКонтрагентаВСтроку(Объект.Код);
	ТипОтвета = ТипКонтрагентаДляОтвета(Группа, ТипКонтрагентаИзЗапроса(ДанныеЗапроса));
	
	Результат.success = Истина;
	Результат.customer = Объект.Наименование;
	Результат.customerCode = КодСтрокой;
	Результат.counterparty = Объект.Наименование;
	Результат.counterpartyCode = КодСтрокой;
	Результат.type = ТипОтвета;
	Результат.group = Строка(Группа);
	Результат.groupCode = КодКонтрагентаВСтроку(Группа.Код);
	Возврат Результат;
	
КонецФункции

Функция КодКонтрагентаВСтроку(Код)
	
	Если Код = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Формат(Код, "ЧГ=0");
	
КонецФункции

Функция НайтиКонтрагента(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("customerCode") И СокрЛП(ДанныеЗапроса.customerCode) <> "" Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(ДанныеЗапроса.customerCode));
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("customer") И СокрЛП(ДанныеЗапроса.customer) <> "" Тогда
		Возврат Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.customer), Истина);
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция НайтиФирму(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("firm") И СокрЛП(ДанныеЗапроса.firm) <> "" Тогда
		Фирма = Справочники.Фирмы.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.firm), Истина);
		Если ЗначениеЗаполнено(Фирма) Тогда
			Возврат Фирма;
		КонецЕсли;
	КонецЕсли;
	
	Фирма = гоФирма();
	Если ЗначениеЗаполнено(Фирма) Тогда
		Возврат Фирма;
	КонецЕсли;
	
	Возврат омСервер.ПолучитьФирму();
	
КонецФункции

Функция НайтиСклад(ДанныеЗапроса, Фирма)
	
	Если ДанныеЗапроса.Свойство("warehouse") И СокрЛП(ДанныеЗапроса.warehouse) <> "" Тогда
		Склад = Справочники.Склады.НайтиПоНаименованию(СокрЛП(ДанныеЗапроса.warehouse), Истина);
		Если ЗначениеЗаполнено(Склад) Тогда
			Возврат Склад;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фирма.Склад) Тогда
		Возврат Фирма.Склад;
	КонецЕсли;
	
	МассивСкладов = омСервер.МассивСкладов();
	Если МассивСкладов.Количество() > 0 Тогда
		Возврат МассивСкладов[0];
	КонецЕсли;
	
	Возврат Справочники.Склады.ПустаяСсылка();
	
КонецФункции

Функция СтрокиЗаказаИзЗапроса(ДанныеЗапроса, Фирма, Склад)
	
	Результат = Новый Структура("Строки, Ошибки", Новый Массив, Новый СписокЗначений);
	
	Если НЕ ДанныеЗапроса.Свойство("items") Тогда
		Результат.Ошибки.Добавить("В теле запроса нет массива items.");
		Возврат Результат;
	КонецЕсли;
	
	Позиции = ДанныеЗапроса.items;
	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		Результат.Ошибки.Добавить("Поле items должно быть массивом.");
		Возврат Результат;
	КонецЕсли;
	
	НомерПозиции = 0;
	Для Каждого Позиция Из Позиции Цикл
		
		НомерПозиции = НомерПозиции + 1;
		
		Если ТипЗнч(Позиция) <> Тип("Структура") Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: неверный формат позиции.", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Количество = 1;
		Если Позиция.Свойство("qty") Тогда
			Количество = Число(Позиция.qty);
		КонецЕсли;
		Если Количество <= 0 Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: qty должно быть больше 0.", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Цена = ЦенаИзПозицииЗапроса(Позиция);
		Если Цена <= 0 Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Строка %1: укажите price (должна совпадать с salePrice из /balances).", НомерПозиции));
			Продолжить;
		КонецЕсли;
		
		Если Позиция.Свойство("serial") И СокрЛП(Позиция.serial) <> "" Тогда
			
			СведенияПартии = СведенияПартииПоСерии(СокрЛП(Позиция.serial), Фирма, Склад);
			Если СведенияПартии = Неопределено Тогда
				Результат.Ошибки.Добавить(СтрШаблон("Строка %1: нет остатка по серии %2.", НомерПозиции, Позиция.serial));
				Продолжить;
			КонецЕсли;
			
			Если СведенияПартии.Остаток < Количество Тогда
				Результат.Ошибки.Добавить(СтрШаблон("Строка %1: остаток %2, требуется %3.",
					НомерПозиции, СведенияПартии.Остаток, Количество));
				Продолжить;
			КонецЕсли;
			
			Если ПартияУжеВЗаказе(Результат.Строки, СведенияПартии.Партия) Тогда
				Результат.Ошибки.Добавить(СтрШаблон("Строка %1: партия уже есть в заказе.", НомерПозиции));
				Продолжить;
			КонецЕсли;
			
			СтрЗаказа = Новый Структура("НомерПозиции, Номенклатура, Партия, Серия, Количество, Цена",
				НомерПозиции,
				СведенияПартии.Номенклатура,
				СведенияПартии.Партия,
				СокрЛП(СведенияПартии.Серия),
				Количество,
				Цена);
			Результат.Строки.Добавить(СтрЗаказа);
			
		Иначе
			
			Номенклатура = НайтиНоменклатуруПоПозиции(Позиция);
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Результат.Ошибки.Добавить(СтрШаблон("Строка %1: укажите serial, itemCode или item (наименование).", НомерПозиции));
				Продолжить;
			КонецЕсли;
			
			ПодобранныеПартии = ПодобратьПартииПоТовару(Позиция, Номенклатура, Фирма, Склад, Количество, ПартииУжеВЗаказе(Результат.Строки));
			Если ПодобранныеПартии.Количество() = 0 Тогда
				Результат.Ошибки.Добавить(СтрШаблон("Строка %1: нет остатка для товара %2%3.",
					НомерПозиции,
					Строка(Номенклатура),
					ТекстФильтраПартииДляОшибки(Позиция)));
				Продолжить;
			КонецЕсли;
			
			Для Каждого СведенияПартии Из ПодобранныеПартии Цикл
				СтрЗаказа = Новый Структура("НомерПозиции, Номенклатура, Партия, Серия, Количество, Цена",
					НомерПозиции,
					СведенияПартии.Номенклатура,
					СведенияПартии.Партия,
					СокрЛП(СведенияПартии.Серия),
					СведенияПартии.Количество,
					Цена);
				Результат.Строки.Добавить(СтрЗаказа);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияПартииПоСерии(Серия, Фирма, Склад)
	
	МассивСерий = Новый Массив;
	МассивСерий.Добавить(Серия);
	Соотв = СведенияПартийПоСериям(МассивСерий, Фирма, Склад);
	Возврат Соотв.Получить(Серия);
	
КонецФункции

Функция НайтиНоменклатуруПоПозиции(Позиция)
	
	Если Позиция.Свойство("itemCode") И СокрЛП(Строка(Позиция.itemCode)) <> "" Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Позиция.itemCode)));
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Если Позиция.Свойство("item") И СокрЛП(Позиция.item) <> "" Тогда
		Наименование = СокрЛП(Позиция.item);
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Ложь);
		КонецЕсли;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Функция ФильтрПартииИзПозиции(Позиция)
	
	Результат = Новый Структура("КодПартии, НаименованиеПартии", "", "");
	
	Если Позиция.Свойство("batchCode") И СокрЛП(Строка(Позиция.batchCode)) <> "" Тогда
		Результат.КодПартии = СокрЛП(Строка(Позиция.batchCode));
	ИначеЕсли Позиция.Свойство("batch") И СокрЛП(Позиция.batch) <> "" Тогда
		Результат.НаименованиеПартии = СокрЛП(Позиция.batch);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстФильтраПартииДляОшибки(Позиция)
	
	Фильтр = ФильтрПартииИзПозиции(Позиция);
	Если Фильтр.КодПартии <> "" Тогда
		Возврат СтрШаблон(" (партия %1)", Фильтр.КодПартии);
	ИначеЕсли Фильтр.НаименованиеПартии <> "" Тогда
		Возврат СтрШаблон(" (партия %1)", Фильтр.НаименованиеПартии);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПартииУжеВЗаказе(СтрокиЗаказа)
	
	МассивПартий = Новый Массив;
	Для Каждого Стр Из СтрокиЗаказа Цикл
		МассивПартий.Добавить(Стр.Партия);
	КонецЦикла;
	Возврат МассивПартий;
	
КонецФункции

Функция ПартияУжеВЗаказе(СтрокиЗаказа, Партия)
	
	Для Каждого Стр Из СтрокиЗаказа Цикл
		Если Стр.Партия = Партия Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

// Подбор одной или нескольких партий: в остатках каждая партия — отдельная запись (часто qty=1),
// а /balances суммирует по наименованию партии. Для qty>1 собираем количество с нескольких партий.
Функция ПодобратьПартииПоТовару(Позиция, Номенклатура, Фирма, Склад, Количество, ИсключитьПартии)
	
	Результат = Новый Массив;
	
	Фильтр = ФильтрПартииИзПозиции(Позиция);
	БезПартии = Фильтр.КодПартии = "" И Фильтр.НаименованиеПартии = "";
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Ост.Партия КАК Партия,
	|	Ост.Партия.Серия КАК Серия,
	|	Ост.Номенклатура КАК Номенклатура,
	|	Ост.ОстатокОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(
	|		,
	|		Фирма = &Фирма
	|			И Склад = &Склад
	|			И Номенклатура = &Номенклатура
	|			И (&БезПартии
	|				ИЛИ Партия.Код = &КодПартии
	|				ИЛИ Партия.Наименование = &НаименованиеПартии)) КАК Ост
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|	И (&ИсключитьПартииПусто
	|		ИЛИ НЕ Ост.Партия В (&ИсключитьПартии))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ост.ОстатокОстаток УБЫВ";
	Зап.УстановитьПараметр("Фирма", Фирма);
	Зап.УстановитьПараметр("Склад", Склад);
	Зап.УстановитьПараметр("Номенклатура", Номенклатура);
	Зап.УстановитьПараметр("КодПартии", Фильтр.КодПартии);
	Зап.УстановитьПараметр("НаименованиеПартии", Фильтр.НаименованиеПартии);
	Зап.УстановитьПараметр("БезПартии", БезПартии);
	Зап.УстановитьПараметр("ИсключитьПартии", ИсключитьПартии);
	Зап.УстановитьПараметр("ИсключитьПартииПусто", ИсключитьПартии.Количество() = 0);
	
	ТаблицаПартий = Зап.Выполнить().Выгрузить();
	Если ТаблицаПартий.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	СуммаОстатка = ТаблицаПартий.Итог("Остаток");
	Если СуммаОстатка < Количество Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОсталосьПодобрать = Количество;
	Для Каждого Стр Из ТаблицаПартий Цикл
		
		Если ОсталосьПодобрать <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		КоличествоИзПартии = Мин(ОсталосьПодобрать, Стр.Остаток);
		Результат.Добавить(Новый Структура("Партия, Номенклатура, Остаток, Серия, Количество",
			Стр.Партия, Стр.Номенклатура, Стр.Остаток, Стр.Серия, КоличествоИзПартии));
		ОсталосьПодобрать = ОсталосьПодобрать - КоличествоИзПартии;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияПартийПоСериям(МассивСерий, Фирма, Склад)
	
	Результат = Новый Соответствие;
	Если МассивСерий.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивВРег = Новый Массив;
	МассивНРег = Новый Массив;
	Для Каждого Эл Из МассивСерий Цикл
		МассивВРег.Добавить(ВРег(Эл));
		МассивНРег.Добавить(НРег(Эл));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Партия КАК Партия,
	|	Рег.ОстатокОстаток КАК Остаток,
	|	Рег.Партия.Серия КАК Серия,
	|	Рег.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки КАК Рег
	|ГДЕ
	|	Рег.Фирма = &Фирма
	|	И Рег.Склад = &Склад
	|	И Рег.ОстатокОстаток >= 1
	|	И (Рег.Партия.Серия В (&Серии)
	|		ИЛИ Рег.Партия.Серия В (&СерииНРег)
	|		ИЛИ Рег.Партия.Серия В (&СерииВРег))";
	Запрос.УстановитьПараметр("Серии", МассивСерий);
	Запрос.УстановитьПараметр("СерииНРег", МассивВРег);
	Запрос.УстановитьПараметр("СерииВРег", МассивНРег);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Фирма", Фирма);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияПартии = Новый Структура("Партия, Номенклатура, Остаток, Серия",
			Выборка.Партия, Выборка.Номенклатура, Выборка.Остаток, Выборка.Серия);
		Серия = СокрЛП(Выборка.Серия);
		Результат.Вставить(Серия, СведенияПартии);
		Результат.Вставить(ВРег(Серия), СведенияПартии);
		Результат.Вставить(НРег(Серия), СведенияПартии);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НоменклатураИзСтрокЗаказа(СтрокиЗаказа)
	
	Уникальные = Новый Соответствие;
	МассивНоменклатуры = Новый Массив;
	Для Каждого Стр Из СтрокиЗаказа Цикл
		Если Уникальные.Получить(Стр.Номенклатура) = Неопределено Тогда
			Уникальные.Вставить(Стр.Номенклатура, Истина);
			МассивНоменклатуры.Добавить(Стр.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивНоменклатуры;
	
КонецФункции

Функция ТекстОшибокСписка(Ошибки)
	
	Текст = "";
	Для Каждого Ошибка Из Ошибки Цикл
		Текст = Текст + Ошибка.Значение + Символы.ПС;
	КонецЦикла;
	Возврат СокрЛП(Текст);
	
КонецФункции

// Фильтр /balances по складу: warehouseId, warehouseCode или code (числовой код из /warehouses).
Функция СкладОстатковИзЗапроса(Запрос)
	
	Результат = Новый Структура("Склад, warehouseCode, Ошибка", Справочники.Склады.ПустаяСсылка(), "", "");
	
	СтрокаКода = "";
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseId");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseCode");
	КонецЕсли;
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли;
	
	Если СтрокаКода = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		КодЧисло = Число(СтрокаКода);
	Исключение
		Результат.Ошибка = "Параметр warehouseId (или warehouseCode) должен быть числовым кодом склада.";
		Возврат Результат;
	КонецПопытки;
	
	Склад = Справочники.Склады.НайтиПоКоду(КодЧисло);
	Если НЕ ЗначениеЗаполнено(Склад) Или Склад.ПометкаУдаления Тогда
		Результат.Ошибка = СтрШаблон("Склад с кодом %1 не найден.", СтрокаКода);
		Возврат Результат;
	КонецЕсли;
	
	МассивДоступных = омСервер.МассивСкладов();
	Если МассивДоступных.Количество() > 0 Тогда
		Доступен = Ложь;
		Для Каждого ДоступныйСклад Из МассивДоступных Цикл
			Если ДоступныйСклад = Склад Тогда
				Доступен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Доступен Тогда
			Результат.Ошибка = "Нет доступа к указанному складу.";
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Склад = Склад;
	Результат.warehouseCode = КодСкладаВСтроку(КодЧисло);
	Возврат Результат;
	
КонецФункции

// Пагинация /balances: page (с 1), pageSize (макс. 500). Считаем уникальную номенклатуру с остатком > 0.
Функция ПараметрыПагинацииОстатков(Запрос)
	
	МаксРазмерСтраницы = 500;
	РазмерПоУмолчанию = 500;
	Результат = Новый Структура("page, pageSize, Ошибка", 1, РазмерПоУмолчанию, "");
	
	СтрокаСтраницы = Запрос.ПараметрыЗапроса.Получить("page");
	СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("pageSize");
	Если СтрокаРазмера = Неопределено Или СокрЛП(СтрокаРазмера) = "" Тогда
		СтрокаРазмера = Запрос.ПараметрыЗапроса.Получить("limit");
	КонецЕсли;
	
	НомерСтраницы = ЦелоеПараметраЗапроса(СтрокаСтраницы, 1);
	Если НомерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр page должен быть целым числом >= 1.";
		Возврат Результат;
	КонецЕсли;
	Если НомерСтраницы = 0 Тогда
		НомерСтраницы = 1;
	КонецЕсли;
	
	РазмерСтраницы = ЦелоеПараметраЗапроса(СтрокаРазмера, РазмерПоУмолчанию);
	Если РазмерСтраницы < 0 Тогда
		Результат.Ошибка = "Параметр pageSize (или limit) должен быть целым числом от 1 до 500.";
		Возврат Результат;
	КонецЕсли;
	Если РазмерСтраницы = 0 Тогда
		РазмерСтраницы = РазмерПоУмолчанию;
	КонецЕсли;
	Если РазмерСтраницы > МаксРазмерСтраницы Тогда
		Результат.Ошибка = СтрШаблон("pageSize не может превышать %1.", МаксРазмерСтраницы);
		Возврат Результат;
	КонецЕсли;
	
	Результат.page = НомерСтраницы;
	Результат.pageSize = РазмерСтраницы;
	Возврат Результат;
	
КонецФункции

Функция ЦелоеПараметраЗапроса(СтрокаЗначения, ЗначениеПоУмолчанию)
	
	Если СтрокаЗначения = Неопределено Или СокрЛП(СтрокаЗначения) = "" Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Попытка
		ЧислоЗначения = Число(СтрокаЗначения);
	Исключение
		Возврат -1;
	КонецПопытки;
	
	Если ЧислоЗначения <> Цел(ЧислоЗначения) Тогда
		Возврат -1;
	КонецЕсли;
	
	Возврат Цел(ЧислоЗначения);
	
КонецФункции

Функция ВсегоСтраницПагинации(ВсегоЭлементов, РазмерСтраницы)
	
	Если ВсегоЭлементов = 0 Или РазмерСтраницы <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Цел((ВсегоЭлементов - 1) / РазмерСтраницы) + 1;
	
КонецФункции

Функция КоличествоНоменклатурыНаОстатках(ДатаОстатков, Склад = Неопределено)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ост.Номенклатура) КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Ост
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|	И Ост.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (&БезСклада
	|		ИЛИ Ост.Склад = &Склад)";
	Зап.УстановитьПараметр("Дата", ДатаОстатков);
	Зап.УстановитьПараметр("БезСклада", НЕ ЗначениеЗаполнено(Склад));
	Зап.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Склад), Склад, Справочники.Склады.ПустаяСсылка()));
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция НоменклатураНаОстаткахСтраница(ДатаОстатков, РазмерСтраницы, Пропустить, Склад = Неопределено)
	
	МассивНоменклатуры = Новый Массив;
	
	Если РазмерСтраницы <= 0 Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	|	Вложенный.Номенклатура КАК Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Ост.Номенклатура КАК Номенклатура,
	|		Ост.Номенклатура.Код КАК КодСортировки,
	|		Ост.Номенклатура.Наименование КАК НаименованиеСортировки
	|	ИЗ
	|		РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Ост
	|	ГДЕ
	|		Ост.ОстатокОстаток > 0
	|		И Ост.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		И (&БезСклада
	|			ИЛИ Ост.Склад = &Склад)) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.КодСортировки,
	|	Вложенный.НаименованиеСортировки";
	Зап.УстановитьПараметр("Дата", ДатаОстатков);
	Зап.УстановитьПараметр("БезСклада", НЕ ЗначениеЗаполнено(Склад));
	Зап.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Склад), Склад, Справочники.Склады.ПустаяСсылка()));
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

Функция ТаблицаОстатковПоНоменклатуре(ДатаОстатков, НоменклатураСтраницы, Склад = Неопределено)
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("warehouse");
	ПустаяТаблица.Колонки.Добавить("item");
	ПустаяТаблица.Колонки.Добавить("itemCode");
	ПустаяТаблица.Колонки.Добавить("sku");
	ПустаяТаблица.Колонки.Добавить("itemType");
	ПустаяТаблица.Колонки.Добавить("manufacturer");
	ПустаяТаблица.Колонки.Добавить("Номенклатура");
	ПустаяТаблица.Колонки.Добавить("batch");
	ПустаяТаблица.Колонки.Добавить("batchCode");
	ПустаяТаблица.Колонки.Добавить("serialParty");
	ПустаяТаблица.Колонки.Добавить("Партия");
	ПустаяТаблица.Колонки.Добавить("qty", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("reserve", Новый ОписаниеТипов("Число"));
	
	Если НоменклатураСтраницы.Количество() = 0 Тогда
		Возврат ПустаяТаблица;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Ост.Склад.Наименование КАК warehouse,
	|	Ост.Номенклатура.Наименование КАК item,
	|	Ост.Номенклатура.Код КАК itemCode,
	|	Ост.Номенклатура.Код КАК sku,
	|	Ост.Номенклатура.ВидНоменклатуры.Наименование КАК itemType,
	|	Ост.Номенклатура.Производитель.Наименование КАК manufacturer,
	|	Ост.Номенклатура КАК Номенклатура,
	|	Ост.Партия.Наименование КАК batch,
	|	Ост.Партия.Код КАК batchCode,
	|	Ост.Партия.Серия КАК serialParty,
	|	Ост.Партия КАК Партия,
	|	Ост.ОстатокОстаток КАК qty,
	|	Ост.РезервОстаток КАК reserve
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Ост
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|	И Ост.Номенклатура В (&Номенклатура)
	|	И (&БезСклада
	|		ИЛИ Ост.Склад = &Склад)";
	Зап.УстановитьПараметр("Дата", ДатаОстатков);
	Зап.УстановитьПараметр("Номенклатура", НоменклатураСтраницы);
	Зап.УстановитьПараметр("БезСклада", НЕ ЗначениеЗаполнено(Склад));
	Зап.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Склад), Склад, Справочники.Склады.ПустаяСсылка()));
	
	Возврат Зап.Выполнить().Выгрузить();
	
КонецФункции

Функция КлючГруппыОстатков(Склад, КодТовара, Партия)
	Возврат Строка(Склад) + "|" + Строка(КодТовара) + "|" + Строка(Партия);
КонецФункции

Процедура ДобавитьСерийникВМассив(МассивСерий, ЗначениеСерии)
	
	Серия = СокрЛП(ЗначениеСерии);
	Если Серия = "" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Существующая Из МассивСерий Цикл
		Если Существующая = Серия Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивСерий.Добавить(Серия);
	
КонецПроцедуры

Функция СерииИзСтрокПриходных(ТаблицаОстатков)
	
	Результат = Новый Соответствие;
	МассивПартий = Новый Массив;
	
	Для Каждого Стр Из ТаблицаОстатков Цикл
		Если ЗначениеЗаполнено(Стр.Партия) Тогда
			МассивПартий.Добавить(Стр.Партия);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивПартий.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Товары.Партия КАК Партия,
	|	Товары.Серия КАК Серия
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК Товары
	|ГДЕ
	|	Товары.Партия В (&Партии)
	|	И Товары.Серия <> """"
	|	И Товары.Ссылка.Проведен";
	Зап.УстановитьПараметр("Партии", МассивПартий);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСерий = Результат.Получить(Выборка.Партия);
		Если МассивСерий = Неопределено Тогда
			МассивСерий = Новый Массив;
			Результат.Вставить(Выборка.Партия, МассивСерий);
		КонецЕсли;
		ДобавитьСерийникВМассив(МассивСерий, Выборка.Серия);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СерииИзСтрокПриходныхПоГруппе(ДатаОстатков, НоменклатураСтраницы = Неопределено, Склад = Неопределено)
	
	Результат = Новый Соответствие;
	
	Если НоменклатураСтраницы <> Неопределено И НоменклатураСтраницы.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Ост.Склад.Наименование КАК warehouse,
	|	Ост.Номенклатура.Код КАК itemCode,
	|	Ост.Партия.Наименование КАК batch,
	|	Товары.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Ост
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК Товары
	|		ПО Ост.Партия = Товары.Партия
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|	И Товары.Серия <> """"
	|	И Товары.Ссылка.Проведен
	|	И (&БезСклада
	|		ИЛИ Ост.Склад = &Склад)";
	
	Если НоменклатураСтраницы <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	И Ост.Номенклатура В (&Номенклатура)";
		Зап.УстановитьПараметр("Номенклатура", НоменклатураСтраницы);
	КонецЕсли;
	
	Зап.Текст = ТекстЗапроса;
	Зап.УстановитьПараметр("Дата", ДатаОстатков);
	Зап.УстановитьПараметр("БезСклада", НЕ ЗначениеЗаполнено(Склад));
	Зап.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Склад), Склад, Справочники.Склады.ПустаяСсылка()));
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = КлючГруппыОстатков(Выборка.warehouse, Выборка.itemCode, Выборка.batch);
		МассивСерий = Результат.Получить(Ключ);
		Если МассивСерий = Неопределено Тогда
			МассивСерий = Новый Массив;
			Результат.Вставить(Ключ, МассивСерий);
		КонецЕсли;
		ДобавитьСерийникВМассив(МассивСерий, Выборка.Серия);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВидЦеныИзПараметра(СтрокаВидаЦены)
	
	Если СтрокаВидаЦены = Неопределено Или СокрЛП(СтрокаВидаЦены) = "" Тогда
		Возврат Перечисления.ВидыЦен.МелкийОпт;
	КонецЕсли;
	
	Норм = ВРег(СокрЛП(СтрокаВидаЦены));
	
	Если Норм = "КРУПНЫЙОПТ" Или Норм = "LARGE" Или Норм = "WHOLESALE" Тогда
		Возврат Перечисления.ВидыЦен.КрупныйОпт;
	КонецЕсли;
	
	Возврат Перечисления.ВидыЦен.МелкийОпт;
	
КонецФункции

Функция УникальнаяНоменклатураИзТаблицы(ТаблицаОстатков)
	
	Уникальные = Новый Соответствие;
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого Стр Из ТаблицаОстатков Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) И Уникальные.Получить(Стр.Номенклатура) = Неопределено Тогда
			Уникальные.Вставить(Стр.Номенклатура, Истина);
			МассивНоменклатуры.Добавить(Стр.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

Функция ЗагрузитьЦеныПродажи(ДатаОстатков, МассивНоменклатуры, ВидЦены)
	
	Результат = Новый Соответствие;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Цены.Номенклатура КАК Номенклатура,
	|	Цены.Цена КАК Цена,
	|	Цены.ЦенаОтКоличества КАК ЦенаОтКоличества,
	|	Цены.Количество КАК КоличествоПорог,
	|	Цены.Валюта.Наименование КАК Валюта
	|ИЗ
	|	РегистрСведений.ЦеныПродажи.СрезПоследних(
	|		&Дата,
	|		Номенклатура В (&Номенклатура)
	|			И ВидЦены = &ВидЦены) КАК Цены";
	Зап.УстановитьПараметр("Дата", ДатаОстатков);
	Зап.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Зап.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(
			Выборка.Номенклатура,
			Новый Структура("Цена, ЦенаОтКоличества, КоличествоПорог, Валюта",
				Выборка.Цена,
				Выборка.ЦенаОтКоличества,
				Выборка.КоличествоПорог,
				Выборка.Валюта));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЦенаИзПозицииЗапроса(Позиция)
	
	Если Позиция.Свойство("price") Тогда
		Возврат Число(Позиция.price);
	КонецЕсли;
	
	Если Позиция.Свойство("salePrice") Тогда
		Возврат Число(Позиция.salePrice);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЦеныСовпадают(ЦенаЗапроса, ОжидаемаяЦена)
	
	Возврат Окр(ЦенаЗапроса, 2) = Окр(ОжидаемаяЦена, 2);
	
КонецФункции

Функция ПроверитьЦеныСтрокЗаказа(СтрокиЗаказа, ЦеныПродажи, ИмяВидаЦены)
	
	Ошибки = Новый СписокЗначений;
	
	Для Каждого СтрЗаказа Из СтрокиЗаказа Цикл
		
		ДанныеЦены = ЦеныПродажи.Получить(СтрЗаказа.Номенклатура);
		ОжидаемаяЦена = ЦенаПродажиПоКоличеству(ДанныеЦены, СтрЗаказа.Количество);
		
		Если ОжидаемаяЦена <= 0 Тогда
			Ошибки.Добавить(СтрШаблон("Строка %1: для товара %2 не задана цена продажи (вид %3).",
				СтрЗаказа.НомерПозиции,
				Строка(СтрЗаказа.Номенклатура),
				ИмяВидаЦены));
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЦеныСовпадают(СтрЗаказа.Цена, ОжидаемаяЦена) Тогда
			Ошибки.Добавить(СтрШаблон("Строка %1: неверная цена. Указано %2, ожидается %3 (salePrice, вид %4).",
				СтрЗаказа.НомерПозиции,
				Формат(СтрЗаказа.Цена, "ЧДЦ=2; ЧРД=.; ЧГ=0"),
				Формат(ОжидаемаяЦена, "ЧДЦ=2; ЧРД=.; ЧГ=0"),
				ИмяВидаЦены));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

Функция ЦенаПродажиПоКоличеству(ДанныеЦены, Количество)
	
	Если ДанныеЦены = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДанныеЦены.КоличествоПорог > 0
		И Количество >= ДанныеЦены.КоличествоПорог
		И ДанныеЦены.ЦенаОтКоличества > 0 Тогда
		Возврат ДанныеЦены.ЦенаОтКоличества;
	КонецЕсли;
	
	Возврат ДанныеЦены.Цена;
	
КонецФункции

Процедура ДобавитьЦенуВСтруктуру(СтруктураЭлемента, ДанныеЦены, Количество, ИмяВидаЦены)
	
	СтруктураЭлемента.Вставить("salePrice", ЦенаПродажиПоКоличеству(ДанныеЦены, Количество));
	СтруктураЭлемента.Вставить("priceType", ИмяВидаЦены);
	
	Валюта = "";
	Если ДанныеЦены <> Неопределено Тогда
		Валюта = Строка(ДанныеЦены.Валюта);
	КонецЕсли;
	СтруктураЭлемента.Вставить("currency", Валюта);
	
КонецПроцедуры
